# Zone Calculated Supply Airflow Property

Source: https://www.revitapidocs.com/2026/f2911c1c-a373-e120-8e41-66a20d82c573.htm

---

| Zone Calculated Supply Airflow Property |
| --- |

**Note: This API is now obsolete.**

Get the Calculated Supply Airflow of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
public double CalculatedSupplyAirflow { get; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>
Public ReadOnly Property CalculatedSupplyAirflow As Double
	Get
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
property double CalculatedSupplyAirflow {
	double get ();
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>]
member CalculatedSupplyAirflow : float with get
```

#### Property Value

Double Remarks This property is used to get the Calculated Supply Airflow (Unit: Airflow ) of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace